#+TITLE: 用emacs管理博客园博客
#+AUTHOR:      野书
#+DATE:        a date, fixed, of a format string for format-time-string
#+EMAIL:       www762268@foxmail.com
#+DESCRIPTION: 掌握用emacs写博客，高亮代码等技巧
#+KEYWORDS:    emacs
#+LANGUAGE:    language for HTML, e.g. ‘en’ (org-export-default-language)
#+TEXT:        Some descriptive text to be inserted at the beginning.
#+TEXT:        Several lines may be given.
#+OPTIONS:     H:2 num:t toc:t \n:nil @:t ::t |:t ^:t f:t TeX:t ...
#+LINK_UP:     the ``up'' link of an exported page
#+LINK_HOME:   the ``home'' link of an exported page
#+LATEX_HEADER: extra line(s) for the LaTeX header, like \usepackage{xyz}
* 前言
** 个人写博客历史
   #+BEGIN_CENTER
   从2015-12-04号开始，记得那时我在学习linux，在那期间我学会了做笔记这个习惯，美其名曰做好\\
   知识储备，但那时我刚玩linux系统，导致我的个人笔记总丢失，那时我就百度啊，看有没有好方法，\\
   然后我就发现了博客，我仔细了解了下，发现好多技术大牛都喜欢写博客，其中的 [[http://linux.vbird.org/][鸟哥的Linux私菜]]\\
   , [[http://xahlee.org/][李杀网]] 等等技术大牛的博客经过多年的整理积累，都已经整理出书了，造福了一代又一代技术大牛\\
   ，我也希望有一天我也能成为他们那样的打牛(请允许我小小的意淫下)；当时我用的是window下的\\
   windows live writer软件，用了几下感觉不太好，更坑爹的是他是window系统下的博客软件，这\\
   让讨厌window系统的我很不爽，然后就开时折腾用emacs写博客，自己能力有限；就参考了大牛\\
   [[http://www.cnblogs.com/Open_Source/archive/2012/09/14/2684897.html][Open-Source的博客《用Emacs管理博客园博客》]] 并用他写的emacs插件[[https://github.com/huwenbiao/cnblogs/][cnblogs]] 然后我就成功了，\\
   我就可以开始我的博客之路了，在此处我要感谢下Open-source,感谢开源运动，毫不夸张的讲，有了\\
   开源，有了我们的春天！！！废话不多讲了，在此处推荐下emacs顶级大牛的配置,希望对你们有帮助,\\
   [[https://github.com/purcell/emacs.d][purcell]] 的配置是我的挚爱，感觉好有结构感，代码洁癖的我不得不膜拜啊！！
   #+END_CENTER
** 基础介绍
   + 一些个人推荐，感兴趣可以看下：\\
     emacs与vim的介绍参照：[[http://os.51cto.com/art/201101/242518.htm][《Emacs和：神的编译器和编译器之神》]]\\
     org-mode的教程：[[http://www.cnblogs.com/Open_Source/archive/2011/07/17/2108747.html][《Org-mode 简明教程》]] \\
   讲这么多废话，接下来进入正题部分
   # 分割线
   # 五条短线或以上显示为分隔线
   ----------
   #+BEGIN_CENTER
     \alpha \\
     \beta\\
     \gamma\\
     M_sun = 1.989 x 10^30 kg \\
     R_{sun} =6.96 x 10^8 m \\
     $a^2=b$ \\
     $b=2$ \\
     $a=+\sqrt{2}$ \\
     $a=-\sqrt{2}$
   #+END_CENTER
   \begin{equation}
   x=\sqrt{b}
   `\end{equation}
   # 如输入一个<s 然后TAB后就变为
   # c为所添加的语言
   # -n 显示行号
   # #+begin_example ... #+end_example  : 单行的例子以冒号开头
   # #+begin_quote ... #+end_quote      通常用于引用，与默认格式相比左右都会留出缩进
   # #+begin_verse ... #+end_verse      默认内容不换行，需要留出空行才能换行
   # #+begin_center ... #+end_center
   # #+begin_latex ... #+end_latex
   # #+latex:
   # #+begin_html ... #+end_html
   # #+html:
   # #+begin_ascii ... #+end_ascii
   # #+ascii:
   # #+index: line
   # 加载一个文件并让它显示出来
   # #+include: "~/.emacs.d/init.el" src emacs-lisp
* 标题
  #+begin_src
  #+TITLE: 用emacs管理博客园博客
  #+end_src
* 段落
  段落一
  # ‘\\’是换行符号
  段落二第一行\\
  段落三第二行
* 字体
  *粗体*\\
  /斜体/\\
  +删除线+\\
  _下划线_\\
  # 注释 这里必须留一个空格要不然2和O都成为小标，目前还不知道怎么去掉空格)
  下标： H_2 O\\
  上标： E=mc^2\\
  等宽字：  =git=\\
* 列表
  1. 有序一级列表
     1. 二级列表\\
        + 无序一级列表
          + 无序二级列表
  2. 有序一级列表
     - 描述列表 :: 描述列表就是这德行
* 嵌入元数据
** a #+BEGIN_ASCI ... #+END_ASCII
   | 快捷键 | 命令 | 功能 |
   |--------+------+------|
   | <a+TAB |      |      |
   #+BEGIN_ASCII
   #+END_ASCII
** A #+ASCII:
   | 快捷键 | 命令 | 功能 |
   |--------+------+------|
   | <A+TAB |      |      |
   #+ASCII:
** c #+BEGIN_CENTER ... #+END_CENTER
   | 快捷键 | 命令 | 功能 |
   |--------+------+------|
   | <c+TAB |      |      |

   #+BEGIN_CENTER

   #+END_CENTER
   + 功能 :: 居中
** e #+BEGIN_EXAMPLE ... #+END_EXAMPLE
   | 快捷键 | 命令 | 功能 |
   |--------+------+------|
   | <e+TAB |      |      |

   #+BEGIN_EXAMPLE

   #+END_EXAMPLE
** H #+HTML:
   | 快捷键 | 命令 | 功能 |
   |--------+------+------|
   | <H+TAB |      |      |

   #+HTML:

** h #+BEGIN_HTML ... #+END_HTML
   | 快捷键 | 命令 | 功能 |
   |--------+------+------|
   | <h+TAB |      |      |

   #+BEGIN_HTML

   #+END_HTML

   + 例程一 :: 用HTML语言生成表格
   #+BEGIN_HTML
   <table border="1">
   <tr>
   <td>row 1, cell 1</td>
   <td>row 1, cell 2</td>
   </tr>
   <tr>
   <td>row 2, cell 1</td>
   <td>row 2, cell 2</td>
   </tr>
   </table>
   #+END_HTML

   #+BEGIN_HTML
   <html>
   <body>

   <h4>背景颜色：</h4>
   <table border="1"
   bgcolor="red">
   <tr>
      <td>First</td>
      <td>Row</td>
   </tr>
   <tr>
       <td>Second</td>
       <td>Row</td>
   </tr>
   </table>

   <h4>背景图像：</h4>
   <table border="1"
   background="/i/eg_bg_07.gif">
   <tr>
       <td>First</td>
       <td>Row</td>
   </tr>
   <tr>
       <td>Second</td>
       <td>Row</td>
   </tr>
   </table>

   </body>
   </html>
   #+END_HTML
   + 例程二 :: 用HTML语言内嵌显示c语言代码
   #+BEGIN_HTML
  <div class="cnblogs_Highlighter">
  <pre class="brush:cpp">
  int main()
  {
    return 0;
  }
  </pre>
  </div>
  #+END_HTML
   - 总结 :: 发现这个东西满好玩的,用这个东东嵌入HTML5语言生成一些个人所需要的插件，\\
             前提是自己得会HTML,不会也没关系，可以百度下自己所需要的，
** I #+INCLUDE:
   | 快捷键 | 命令 | 功能 |
   |--------+------+------|
   | <I+TAB |      |      |
   # #+INCLUDE: "~/Documents/6.杂记/1.用emacs写cnblogs博客.org"
   #+INCLUDE:
** i #+INDEX:
 | 快捷键 | 命令 | 功能 |
 |--------+------+------|
 | <i+TAB |      |      |
   #+INDEX:
** l #+BEGIN_LaTeX ... #+END_LaTeX
   | 快捷键 | 命令 | 功能 |
   |--------+------+------|
   | <l+TAB |      |      |
   #+BEGIN_LaTeX

   #+END_LaTeX
** L #+LaTeX:
   | 快捷键 | 命令 | 功能 |
   |--------+------+------|
   | <L+TAB |      |      |
   #+LaTeX:
** q #+BEGIN_QUOTE ... #+END_QUOTE
   | 快捷键 | 命令 | 功能 |
   |--------+------+------|
   | <q+TAB |      |      |
   #+BEGIN_QUOTE

   #+END_QUOTE
   - 引用 ::
** s #+BEGIN_SRC ... #+END_SRC
   | 快捷键 | 命令 | 功能 |
   |--------+------+------|
   | <s+TAB |      |      |
   #+BEGIN_SRC

   #+END_SRC

** V #+BEGIN_VERBATIM ... #+END_VERBATIM
   | 快捷键 | 命令 | 功能 |
   |--------+------+------|
   | <V+TAB |      |      |
   #+BEGIN_VERBATIM

   #+END_VERBATIM
** v #+BEGIN_VERSE ... #+END_VERSE
   | 快捷键 | 命令 | 功能 |
   |--------+------+------|
   | <v+TAB |      |      |
   #+BEGIN_VERSE

   #+END_VERSE

* 注释
** 行注释
   # 这行被注释
** 块注释
   #+BEGIN_COMMENT
   我被注释了，你们都看不到我哦！！
   #+END_COMMENT
* 表格
  | 数量 | 单价 |  总额 |
  |------+------+-------|
  |    2 | 3.45 |   6.9 |
  |    4 | 4.34 | 17.36 |
  |    5 | 3.44 |  17.2 |
  |    5 |  5.6 |   28. |
  #+TBLFM: $3=$1*$2

   #+NAME: My Target
 | a  | table      |
 | of | four cells |
* 链接
* 脚注
* 标签
* D
#+ATTR_HTML: :textarea t :width 40
     #+BEGIN_EXAMPLE
       (defun org-xor (a b)
          "Exclusive or."
          (if a (not b) b))
     #+END_EXAMPLE
* 说明
  - 这是我边用边学总结的，有很多不足之处，希望大家能给些建议帮助我修改本篇文章//
  谢谢各位了！！！！持续更新状态....
  #+BEGIN_HTML
  h3{background: #390;
  border-bottom: 1px solid #060;
  border-radius: 3px;
  color: #FFF;
  padding: 5px;
  text-indent: 0.5em;
  text-shadow: 1px 1px 0 rgba(0, 0, 0, 0.3);}
  #+END_HTML
